PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18lf1230.inc
;----- CONFIG1H Options --------------------------------------------------
_OSC_LP_1H           EQU  H'F0'; LP Oscillator
_OSC_XT_1H           EQU  H'F1'; XT Oscillator
_OSC_HS_1H           EQU  H'F2'; HS Oscillator
_OSC_RC_1H           EQU  H'F3'; External RC oscillator, CLKO function on RA6
_OSC_EC_1H           EQU  H'F4'; EC oscillator, CLKO function on RA6
_OSC_ECIO_1H         EQU  H'F5'; EC oscillator, port function on RA6
_OSC_HSPLL_1H        EQU  H'F6'; HS oscillator, PLL enabled (Clock Frequency = 4 x FOSC1)
_OSC_RCIO_1H         EQU  H'F7'; External RC oscillator, port function on RA6
_OSC_INTIO2_1H       EQU  H'F8'; Internal oscillator, port function on RA6 and RA7
_OSC_INTIO1_1H       EQU  H'F9'; Internal oscillator, CLKO function on RA6, port function on RA7

_FCMEN_OFF_1H        EQU  H'BF'; Fail-Safe Clock Monitor disabled
_FCMEN_ON_1H         EQU  H'FF'; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'; Oscillator Switchover mode disabled
_IESO_ON_1H          EQU  H'FF'; Oscillator Switchover mode enabled

;----- CONFIG2L Options --------------------------------------------------
_PWRT_ON_2L          EQU  H'FE'; PWRT enabled
_PWRT_OFF_2L         EQU  H'FF'; PWRT disabled

_BOR_OFF_2L          EQU  H'F9'; Brown-out Reset disabled in hardware and software
_BOR_SBORENCTRL_2L   EQU  H'FB'; Brown-out Reset enabled and controlled by software (SBOREN is enabled)
_BOR_BOACTIVE_2L     EQU  H'FD'; Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)
_BOR_BOHW_2L         EQU  H'FF'; Brown-out Reset enabled in hardware only (SBOREN is disabled)

_BORV_0_2L           EQU  H'E7'; Maximum setting
_BORV_1_2L           EQU  H'EF'
_BORV_2_2L           EQU  H'F7'
_BORV_3_2L           EQU  H'FF'; Minimum setting

;----- CONFIG2H Options --------------------------------------------------
_WDT_OFF_2H          EQU  H'FE'; WDT disabled (control is placed on the SWDTEN bit)
_WDT_ON_2H           EQU  H'FF'; WDT enabled

_WDTPS_1_2H          EQU  H'E1'; 1:1
_WDTPS_2_2H          EQU  H'E3'; 1:2
_WDTPS_4_2H          EQU  H'E5'; 1:4
_WDTPS_8_2H          EQU  H'E7'; 1:8
_WDTPS_16_2H         EQU  H'E9'; 1:16
_WDTPS_32_2H         EQU  H'EB'; 1:32
_WDTPS_64_2H         EQU  H'ED'; 1:64
_WDTPS_128_2H        EQU  H'EF'; 1:128
_WDTPS_256_2H        EQU  H'F1'; 1:256
_WDTPS_512_2H        EQU  H'F3'; 1:512
_WDTPS_1024_2H       EQU  H'F5'; 1:1024
_WDTPS_2048_2H       EQU  H'F7'; 1:2048
_WDTPS_4096_2H       EQU  H'F9'; 1:4096
_WDTPS_8192_2H       EQU  H'FB'; 1:8192
_WDTPS_16384_2H      EQU  H'FD'; 1:16384
_WDTPS_32768_2H      EQU  H'FF'; 1:32768

;----- CONFIG3L Options --------------------------------------------------
_PWMPIN_ON_3L        EQU  H'FD'; PWM outputs drive active states upon Reset
_PWMPIN_OFF_3L       EQU  H'FF'; PWM outputs disabled upon Reset

_LPOL_LOW_3L         EQU  H'FB'; PWM0, PWM2 and PWM4 are active-low
_LPOL_HIGH_3L        EQU  H'FF'; PWM0, PWM2 and PWM4 are active-high (default)

_HPOL_LOW_3L         EQU  H'F7'; PWM1, PWM3 and PWM5 are active-low
_HPOL_HIGH_3L        EQU  H'FF'; PWM1, PWM3 and PWM5 are active-high (default)

;----- CONFIG3H Options --------------------------------------------------
_FLTAMX_RA7_3H       EQU  H'FE'; FLTA input is muxed onto RA7
_FLTAMX_RA5_3H       EQU  H'FF'; FLTA input is muxed onto RA5

_T1OSCMX_LOW_3H      EQU  H'F7'; T1OSO/T1CKI pin resides on RB2
_T1OSCMX_HIGH_3H     EQU  H'FF'; T1OSO/T1CKI pin resides on RA6

_MCLRE_OFF_3H        EQU  H'7F'; RA5 input pin enabled, MCLR pin disabled
_MCLRE_ON_3H         EQU  H'FF'; MCLR pin enabled, RA5 input pin disabled

;----- CONFIG4L Options --------------------------------------------------
_STVREN_OFF_4L       EQU  H'FE'; Reset on stack overflow/underflow disabled
_STVREN_ON_4L        EQU  H'FF'; Reset on stack overflow/underflow enabled

_BBSIZ_BB256_4L      EQU  H'CF'; 256 Words (512 Bytes) Boot Block size
_BBSIZ_BB512_4L      EQU  H'FF'; 512 Words (1024 Bytes) Boot Block size

_XINST_OFF_4L        EQU  H'BF'; Instruction set extension and Indexed Addressing mode disabled
_XINST_ON_4L         EQU  H'FF'; Instruction set extension and Indexed Addressing mode enabled

_DEBUG_ON_4L         EQU  H'7F'; Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug
_DEBUG_OFF_4L        EQU  H'FF'; Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'; Block 0 is code-protected
_CP0_OFF_5L          EQU  H'FF'; Block 0 is not code-protected

_CP1_ON_5L           EQU  H'FD'; Block 1 is code-protected
_CP1_OFF_5L          EQU  H'FF'; Block 1 is not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'; Boot Block is code-protected
_CPB_OFF_5H          EQU  H'FF'; Boot Block is not code-protected

_CPD_ON_5H           EQU  H'7F'; Data EEPROM is code-protected
_CPD_OFF_5H          EQU  H'FF'; Data EEPROM is not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'; Block 0 is write-protected
_WRT0_OFF_6L         EQU  H'FF'; Block 0 is not write-protected

_WRT1_ON_6L          EQU  H'FD'; Block 1 is write-protected
_WRT1_OFF_6L         EQU  H'FF'; Block 1 is not write-protected

;----- CONFIG6H Options --------------------------------------------------
_WRTC_ON_6H          EQU  H'DF'; Configuration registers are write-protected
_WRTC_OFF_6H         EQU  H'FF'; Configuration registers are not write-protected

_WRTB_ON_6H          EQU  H'BF'; Boot Block is write-protected
_WRTB_OFF_6H         EQU  H'FF'; Boot Block is not write-protected

_WRTD_ON_6H          EQU  H'7F'; Data EEPROM is write-protected
_WRTD_OFF_6H         EQU  H'FF'; Data EEPROM is not write-protected

;----- CONFIG7L Options --------------------------------------------------
_EBTR0_ON_7L         EQU  H'FE'; Block 0 is protected from table reads executed in other blocks
_EBTR0_OFF_7L        EQU  H'FF'; Block 0 is not protected from table reads executed in other blocks

_EBTR1_ON_7L         EQU  H'FD'; Block 1 is protected from table reads executed in other blocks
_EBTR1_OFF_7L        EQU  H'FF'; Block 1 is not protected from table reads executed in other blocks

;----- CONFIG7H Options --------------------------------------------------
_EBTRB_ON_7H         EQU  H'BF'; Boot Block is protected from table reads executed in other blocks
_EBTRB_OFF_7H        EQU  H'FF'; Boot Block is not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'

        LIST
